package asg;
/**
 *   3-10) 345,780원 
          지급 10만원권 : 3 장
                  5만원    : 
                  1만원    : 4장
                  5천원    : 1장
                  1천원    : 
                  5백원    : 1개
                    백원    : 2개
                  5십원    : 1개
                   십원    : 3개
 */
public class asg03_10 {

	public static void main(String[] args) {
		int exchange = 345780;
		for(;;) {
			
		}
			//100000, 50000, 10000
			//5000, 1000
			//500, 100
			//50, 10
			//100000 /10, /10 /10 /10 
			//50000 /10, /10 /10 
	}

}
